<template>
	<v-container class="task-description">
		<section class="content">
			<header>
				<h1 class="task-title">1. Task-runner</h1>
			</header>
			<section class="content">
				<p>
					Вы должны реализовать упрощённый интерфейс редактора кода (аналог leetcode.com), где
					пользователь может писать код на одном из двух заданных языков (например, Go и Python),
					отправлять его «на сервер» (имитация сервера) для выполнения и получать результаты.
				</p>
				<p>Требования:</p>
				<ol>
					<li>
						<strong>Редактор кода</strong>
						<ul>
							<li>
								Использовать одну из популярных библиотек редакторов (например,
								[CodeMirror](https://codemirror.net/), [Monaco
								Editor](https://microsoft.github.io/monaco-editor/), или [Ace
								Editor](https://ace.c9.io/)).
							</li>
							<li>
								Пользователь может писать код, синтаксис должен быть подсвечен (например, подсветка
								для ключевых слов, строк и т.д.).
							</li>
							<li>
								Предусмотреть возможность переключения языка программирования (например, выпадающий
								список).
							</li>
						</ul>
					</li>
					<li>
						<strong>Запуск кода:</strong>
						<ul>
							<li>
								Реализовать кнопку "Run", при нажатии на которую код отправляется на «сервер».
							</li>
							<li>
								<span
									>Для имитации серверной части вы можете использовать один из предложенных
									вариантов:</span
								>
								<ul>
									<li>
										Локальный мок: Реализуйте обработчик запросов внутри приложения, используя
										<code>fetch</code> и <code>setTimeout</code> для задержки и возврата
										предопределенных данных.
									</li>
									<li>
										<strong><code>json-server:</code></strong> Установите и настройте
										<code>json-server</code> для создания локального REST API, возвращающего
										статичные ответы.
									</li>
									<li>
										<strong><code>miragejs:</code></strong> Настройте библиотеку
										<code>miragejs</code> для обработки POST-запросов и возврата мокированных
										данных.
									</li>
									<li>Любой свой вариант.</li>
								</ul>
							</li>
							<li>
								Серверная часть должна обрабатывать запросы и возвращать результаты (успех или
								ошибку) в формате JSON. Выберите способ, который вам наиболее удобен.
							</li>
						</ul>
					</li>
					<li>
						<strong>Отображение результатов выполнения:</strong>
						<ul>
							<li>
								<span
									>После "запуска” кода, результат выполнения должен отображаться в текстовом
									поле/блоке под редактором.</span
								>
								<ul>
									<li>Если успех — показать вывод (например, строки, которые код "напечатал").</li>
									<li>Если ошибка — отобразить сообщение об ошибке.</li>
								</ul>
							</li>
						</ul>
					</li>
					<li>
						<strong>UI/UX и общие требования:</strong>
						<ul>
							<li>Страница должна быть максимально простой и удобной для пользователей.</li>
							<li>
								Страница должна включать:
								<ul>
									<li>Блок с текстом описания задачи (текст описания любой задачи).</li>
									<li>Страница с компонентом редактора кода.</li>
									<li>Выпадающий список выбора языка.</li>
									<li>Кнопка для отправки кода на сервер.</li>
									<li>Блок для отображения результатов выполнения кода.</li>
								</ul>
							</li>
							<li>Верстка и стили могут быть минимальными, но аккуратными.</li>
							<li>Код приложения должен быть структурированным, чистым и легко читаемым.</li>
							<li>Можно использовать любой фреймворк: React/Vue/Angular.</li>
							<li>
								Приложение должно реагировать на изменение размера окна, стараться выглядеть
								корректно и на небольших экранах (адаптивность на базовом уровне).
							</li>
						</ul>
					</li>
				</ol>
			</section>
		</section>
	</v-container>
</template>

<style code>
.task-description {
	border-right: 1px solid #e6e6e6;
}
ol,
ul {
	list-style-position: inside;
	ol,
	ul {
		margin-left: 2.5em;
	}
	li,
	strong,
	span {
		margin-bottom: 0.5em;
	}
}
p {
	margin-bottom: 1em;
}
</style>
